Revit 2015 API
DefaultDivideSettings.SetNumber Method
 Sets the default Divided Surface number for a fixed number layout for U or V gridlines. This method is obsolete in Revit 2015. Use setSurfaceNumber instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute]
public void SetNumber(
	UVGridlineType gridlines,
	int number
)
Visual Basic
<ObsoleteAttribute> _
Public Sub SetNumber ( _
	gridlines As UVGridlineType, _
	number As Integer _
)
Visual C++
[ObsoleteAttribute]
public:
void SetNumber(
	UVGridlineType gridlines,
	int number
)
Parameters
gridlines
Type: Autodesk.Revit.DB.UVGridlineType
 U-gridlines or V-gridlines.
number
Type: System.Int32
 A default number for a fixed number layout.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given value for number is not positive. -or- A value passed for an enumeration argument is not a member of that enumeration
See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace